[
    {
        "title": "The Three Little Pigs",
        "author": "Traditional",
        "publication_date": "Unknown",
        "content": "Once upon a time, three little pigs ventured out into the world to build their own homes and seek independence. Each pig had a different idea of how to construct their house. The first pig, eager for a quick and easy solution, built his house from straw. It was completed in a day, and he felt quite proud of his simple abode. The second pig, slightly more cautious but still wanting to avoid too much work, decided on sticks. His house, though stronger than straw, still lacked durability.\n\nThe third pig, known for his diligence and wisdom, spent days gathering bricks and laboring to construct a sturdy house. Despite his brothers teasing him for his slow progress, he persisted, knowing that a strong foundation was key.\n\nOne fateful day, a hungry wolf appeared. Approaching the straw house, he demanded entry. When the first pig refused, the wolf huffed, puffed, and blew the flimsy house down effortlessly. Terrified, the first pig ran to his brother's stick house. The wolf followed and repeated his demand. Though the stick house held up slightly longer, it too succumbed to the wolf's breath.\n\nThe two pigs fled to their brother's brick house. The wolf, determined to catch his meal, huffed and puffed with all his might but could not topple the brick house. Frustrated, he climbed onto the roof, attempting to enter through the chimney. However, the third pig had anticipated this and set a pot of boiling water in the fireplace. When the wolf descended, he fell into the pot and yelped in pain, fleeing into the woods and never returning.\n\nFrom that day on, the three pigs lived peacefully in the brick house, forever grateful for their brother's hard work and foresight. They learned an invaluable lesson about the importance of perseverance and building strong foundations."
    },
    {
        "title": "Little Red Riding Hood",
        "author": "Charles Perrault",
        "publication_date": "1697",
        "content": "Once upon a time, a sweet girl named Little Red Riding Hood set off to visit her grandmother, who was ill. Her mother warned her to stay on the path and avoid talking to strangers.\n\nIn the forest, she met a sly wolf who asked where she was going. Innocently, she told him about her grandmother's house. The wolf suggested she pick some flowers, and while she did, he hurried to the grandmother's house.\n\nThe wolf locked the grandmother in a closet and disguised himself in her clothes. When Little Red Riding Hood arrived, she noticed her \"grandmother\" looked different.\n\n\"Grandmother, what big eyes you have!\"\n\n\"All the better to see you with,\" the wolf replied.\n\n\"Grandmother, what big ears you have!\"\n\n\"All the better to hear you with.\"\n\n\"Grandmother, what big teeth you have!\"\n\n\"All the better to eat you with!\" The wolf lunged, but a nearby woodsman heard the commotion and rushed in, rescuing Little Red Riding Hood and her grandmother. The wolf fled, and they all learned the importance of caution and heeding advice."
    },
    {
        "title": "Cinderella",
        "author": "Charles Perrault",
        "publication_date": "1697",
        "content": "Cinderella lived with her wicked stepmother and stepsisters, who treated her as a servant. When the king announced a royal ball, they forbade her from attending.\n\nLeft alone, Cinderella's Fairy Godmother appeared, transforming a pumpkin into a carriage, mice into horses, and rags into a beautiful gown, with glass slippers. She warned the magic would end at midnight.\n\nAt the ball, the prince was captivated by Cinderella. They danced until the clock struck midnight. She fled, leaving a glass slipper behind.\n\nThe prince searched the kingdom for the slipper's owner. When he arrived at Cinderella's home, the stepsisters tried but couldn't fit the slipper. Cinderella tried, and it fit perfectly. She and the prince married, living happily ever after."
    },
    {
        "title": "The Frog Prince",
        "author": "Brothers Grimm",
        "publication_date": "1812",
        "content": "A princess lost her golden ball in a pond. A frog offered to retrieve it if she promised to be his friend. She agreed, and he retrieved it.\n\nShe didn't keep her promise, but the frog followed her to the castle. Her father, the king, insisted she honor her word. She reluctantly let the frog eat with her and stay in her room.\n\nThe frog transformed into a prince, freed from a curse by her companionship. They married, learning the value of keeping promises."
    },
    {
        "title": "Hansel and Gretel",
        "author": "Brothers Grimm",
        "publication_date": "1812",
        "content": "Once upon a time, in a small cottage at the edge of a dense forest, lived a poor woodcutter with his two children, Hansel and Gretel, and their stepmother. Times were tough, and food was scarce. One evening, as the children lay in bed, they overheard their stepmother whispering to their father.\n\n\"We have too many mouths to feed,\" she said. \"We must take the children into the forest and leave them there. It's the only way we'll survive.\"\n\nThe woodcutter was heartbroken but reluctantly agreed. Hansel, being clever, gathered white pebbles that night, filling his pockets. The next morning, the stepmother led them deep into the forest. Hansel discreetly dropped the pebbles along the way.\n\nAfter abandoning the children, the adults left. But as night fell, the moonlight illuminated the pebbles, guiding Hansel and Gretel back home. Their stepmother was furious upon their return but decided to try again.\n\nThis time, Hansel couldn't collect pebbles, so he used breadcrumbs to mark the path. Unfortunately, birds ate the crumbs, leaving them lost. Wandering for days, they stumbled upon a house made entirely of candy and sweets.\n\nHungry and tired, they began to eat the house. An old woman emerged, inviting them inside with promises of food and rest. Little did they know, she was a wicked witch who lured children to eat them.\n\nThe witch locked Hansel in a cage, forcing Gretel to cook to fatten him up. One day, the witch prepared to cook Hansel but asked Gretel to check the oven first. Sensing danger, Gretel pretended not to understand. Frustrated, the witch demonstrated, and Gretel seized the moment, pushing her into the oven and locking the door.\n\nGretel freed Hansel, and they discovered treasures in the witch's house. Filling their pockets, they journeyed home, where their father welcomed them with tears of joy. The wicked stepmother had perished, and they lived happily ever after."
    },
    {
        "title": "The Tortoise and the Hare",
        "author": "Aesop",
        "publication_date": "600 BCE",
        "content": "In a forest, a hare mocked a slow-moving tortoise for his pace. Tired of the ridicule, the tortoise challenged the hare to a race. Amused, the hare agreed.\n\nAt the start, the hare sprinted ahead and, confident of his victory, decided to nap midway. The tortoise, maintaining a steady pace, continued without rest. While the hare slept, the tortoise overtook him and reached the finish line first.\n\nThe animals cheered as the tortoise won, teaching the hare that arrogance and overconfidence can lead to downfall, while perseverance and consistency lead to success."
    },
    {
        "title": "The Velveteen Rabbit",
        "author": "Margery Williams",
        "publication_date": "1922",
        "content": "On Christmas morning, a boy received a stuffed velveteen rabbit. The rabbit longed to become real through the boy's love. Over time, the boy cherished the rabbit, making him his favorite toy.\n\nThe rabbit learned from an old horse that realness comes from being loved deeply. As the boy's love grew, the rabbit became worn but happier.\n\nWhen the boy fell ill, the doctor ordered all his toys burned to prevent the spread of disease. Heartbroken, the rabbit awaited his fate. However, a fairy appeared, transforming him into a real rabbit because of the boy's love.\n\nThe rabbit joined other rabbits in the wild, occasionally visiting the boy, who never realized his beloved toy had become real."
    },
    {
        "title": "Peter Pan",
        "author": "J.M. Barrie",
        "publication_date": "1911",
        "content": "In London, Wendy Darling and her brothers, John and Michael, were visited by Peter Pan, a boy who never grew up. He invited them to Neverland, a place of eternal childhood.\n\nWith a sprinkle of fairy dust from Tinker Bell, they flew to Neverland, encountering the Lost Boys, mermaids, and the villainous Captain Hook.\n\nAfter various adventures, including rescuing Tiger Lily and battling pirates, the children decided to return home, realizing the importance of family and growing up.\n\nPeter Pan remained in Neverland, embodying the spirit of eternal youth, while the Darlings cherished their magical memories."
    },
    {
        "title": "Beauty and the Beast",
        "author": "Jeanne-Marie Leprince de Beaumont",
        "publication_date": "1756",
        "content": "In a distant land, a merchant became lost and sought refuge in a castle. He picked a rose for his daughter, angering the Beast who owned the castle. To spare his life, the merchant agreed to send his daughter, Belle, to live with the Beast.\n\nInitially frightened, Belle discovered the Beast's kindness and intelligence. Over time, they developed a deep bond.\n\nWhen Belle learned her father was ill, the Beast allowed her to visit him, giving her a mirror to remember him by. Belle's sisters, jealous of her happiness, tried to delay her return.\n\nHeartbroken, the Beast began to wither. Realizing her love for him, Belle returned and confessed her feelings, breaking the curse and transforming the Beast back into a prince.\n\nThey married and lived happily, teaching that true beauty lies within."
    },
    {
        "title": "The Princess and the Pea",
        "author": "Hans Christian Andersen",
        "publication_date": "1835",
        "content": "In search of a true princess to marry, a prince was disappointed by impostors. One stormy night, a drenched girl knocked on the castle door, claiming to be a princess.\n\nTo test her authenticity, the queen placed a pea under twenty mattresses and twenty featherbeds, knowing only a true princess would feel it.\n\nThe next morning, the girl complained of a sleepless night due to something hard in her bed. This sensitivity proved her royalty, and she and the prince married, living happily ever after."
    },
    {
        "title": "The Elves and the Shoemaker",
        "author": "Brothers Grimm",
        "publication_date": "1812",
        "content": "A kind but poor shoemaker had only enough leather for one pair of shoes. Leaving the cut leather overnight, he awoke to find a beautifully crafted pair, which sold quickly.\n\nThis pattern continued, with mysterious shoes appearing each morning, bringing prosperity to the shoemaker and his wife.\n\nOne night, they hid to discover two tiny elves sewing the shoes. Wanting to repay their kindness, the couple made clothes and shoes for the elves, who, delighted, danced away and never returned.\n\nThe shoemaker and his wife continued to thrive, grateful for the elves' generosity."
    },
    {
        "title": "The Pied Piper of Hamelin",
        "author": "Brothers Grimm",
        "publication_date": "1816",
        "content": "The town of Hamelin was infested with rats. A mysterious piper offered to rid the town of the pests for a fee. The townspeople agreed, and he played his pipe, leading the rats into the river to drown.\n\nHowever, the townspeople reneged on their promise, refusing to pay. In retaliation, the piper played his pipe again, this time leading the children of Hamelin away.\n\nThey vanished into a mountain, never to return, teaching the town the importance of keeping promises."
    },
    {
        "title": "Rumpelstiltskin",
        "author": "Brothers Grimm",
        "publication_date": "1812",
        "content": "A miller falsely boasted to the king that his daughter could spin straw into gold. The king demanded she prove it, locking her in a room filled with straw.\n\nDesperate, she was approached by a strange little man who offered to spin the straw into gold in exchange for her necklace. She agreed, and the king was pleased but demanded more.\n\nThe second night, she traded her ring for the little man's help. On the third night, with nothing left to offer, she promised her firstborn child.\n\nYears later, when she became queen and had a child, the little man returned to claim his due. She pleaded, and he offered a deal: if she could guess his name within three days, she could keep her child.\n\nAfter two unsuccessful attempts, she learned his name was Rumpelstiltskin. When she revealed it, he flew into a rage and disappeared, never to trouble her again."
    },
    {
        "title": "The Emperor's New Clothes",
        "author": "Hans Christian Andersen",
        "publication_date": "1837",
        "content": "An emperor obsessed with fashion was approached by two swindlers claiming to weave invisible clothes that were invisible to the incompetent.\n\nEager to have such attire, the emperor commissioned them. The swindlers pretended to weave, presenting nothing. Fearing being seen as unfit, everyone, including the emperor, pretended to see the clothes.\n\nParading through the city in his \"new clothes,\" a child exclaimed, \"The emperor has no clothes!\" The crowd realized the truth, and the embarrassed emperor hurried back to his palace, learning the folly of vanity."
    },
    {
        "title": "Hop-o'-My-Thumb",
        "author": "Charles Perrault",
        "publication_date": "1697",
        "content": "In a poor woodcutter's family, the youngest of seven children, Hop-o'-My-Thumb, was small but clever. Facing famine, the parents decided to abandon their children in the forest.\n\nOverhearing this, Hop-o'-My-Thumb collected white pebbles, dropping them along the path to find their way back home.\n\nThe second time, he used breadcrumbs, but birds ate them, leaving them lost. They found a house belonging to an ogre. To avoid being eaten, Hop-o'-My-Thumb swapped his brothers' hats with the ogre's daughters' crowns, leading the ogre to mistakenly kill his own children.\n\nThe boys escaped, and Hop-o'-My-Thumb stole the ogre's seven-league boots, using them to find their way home and bring wealth to his family."
    },
    {
        "title": "Goldilocks and the Three Bears",
        "author": "Robert Southey",
        "publication_date": "1837",
        "content": "One bright morning, a curious young girl named Goldilocks wandered into the woods and stumbled upon a small, charming cottage. Intrigued, she knocked on the door, but no one answered. The door was slightly ajar, so she stepped inside.\n\nIn the kitchen, Goldilocks found three bowls of porridge on the table. Hungry, she tasted the porridge in the first bowl, but it was too hot. The second bowl was too cold. The third bowl was just right, so she ate it all. \n\nNext, she entered the living room and saw three chairs. The first chair was too big, the second too soft, but the third was just right. As she sat down, the chair creaked and broke under her weight. Feeling tired, she wandered upstairs to the bedroom, where she found three beds. The first bed was too hard, the second too soft, but the third was so cozy that she fell asleep.\n\nMeanwhile, the cottage's owners—Papa Bear, Mama Bear, and Baby Bear—returned home. They noticed someone had eaten their porridge, sat in their chairs, and finally, they found Goldilocks asleep in Baby Bear's bed. Startled, she awoke to see the bears staring at her and dashed out of the cottage, vowing to respect others' belongings in the future."
    },
    {
        "title": "The Ugly Duckling",
        "author": "Hans Christian Andersen",
        "publication_date": "1843",
        "content": "In a peaceful farmyard, a mother duck's eggs began to hatch, revealing fluffy yellow ducklings—except for one. The last duckling was larger, clumsier, and gray, earning him the nickname 'ugly duckling' from his siblings. They teased him relentlessly, and even other animals ostracized him.\n\nUnable to bear the mockery, the ugly duckling fled the farm. He wandered through swamps and endured the biting cold of winter, barely surviving. Along his journey, he admired the grace of swans but believed he would never be as beautiful.\n\nOne spring morning, while gazing at his reflection in a pond, he was astonished to see a majestic swan staring back at him. He realized he had grown into a swan, not a duck. Other swans welcomed him, and his journey of hardship transformed into a story of belonging and self-discovery. The ugly duckling finally understood that true beauty emerges with time and acceptance."
    },
    {
        "title": "Jack and the Beanstalk",
        "author": "Traditional",
        "publication_date": "1807",
        "content": "Jack, a young boy from a poor family, lived with his widowed mother. Their only possession was a cow that stopped giving milk. Jack was sent to the market to sell the cow, but instead traded it for a handful of magic beans. Furious, his mother threw the beans out the window and sent Jack to bed without dinner.\n\nBy morning, a massive beanstalk had sprouted, reaching into the clouds. Jack climbed it and discovered a giant's castle above. Inside, he found treasures such as a golden harp and a hen that laid golden eggs. Jack decided to take the hen but was spotted by the giant, who chased him down the beanstalk.\n\nThinking quickly, Jack grabbed an axe and chopped the beanstalk, causing the giant to fall to his doom. With the golden hen, Jack and his mother lived a life of comfort, grateful for their newfound fortune."
    },
    {
        "title": "The Boy Who Cried Wolf",
        "author": "Aesop",
        "publication_date": "600 BCE",
        "content": "In a small village, a shepherd boy tended a flock of sheep. Bored and seeking amusement, he called out, 'Wolf! Wolf!' The villagers, worried for the sheep, rushed to his aid, only to find there was no wolf. The boy laughed at their frustration.\n\nHe repeated the prank multiple times, each time the villagers grew more annoyed. One day, a real wolf appeared, and the boy cried out for help. This time, the villagers ignored him, thinking it was another trick. The wolf scattered the flock, leaving the boy to reflect on how his lies had cost him the trust of others."
    },
    {
        "title": "Snow White and the Seven Dwarfs",
        "author": "Brothers Grimm",
        "publication_date": "1812",
        "content": "Snow White, a princess with unparalleled beauty, lived with her jealous stepmother, the queen. The queen, consumed by envy, ordered a huntsman to kill Snow White and bring back her heart. Unable to do so, the kind huntsman let her escape into the forest.\n\nSnow White stumbled upon a cozy cottage belonging to seven dwarfs. They welcomed her and offered her refuge. Meanwhile, the queen, discovering Snow White was still alive, disguised herself as an old woman and gave Snow White a poisoned apple. Snow White fell into a deep, enchanted sleep.\n\nA prince, passing through the forest, found Snow White in her glass coffin and was so enchanted by her beauty that he kissed her. The spell broke, and Snow White awoke. The prince and Snow White married, living happily ever after, while the wicked queen met her demise."
    },
    {
        "title": "The Princess and the Pea",
        "author": "Hans Christian Andersen",
        "publication_date": "1835",
        "content": "In a distant kingdom, a young prince desired to marry a true princess. Many claimed to be royalty, but he doubted their authenticity. One stormy night, a soaked and bedraggled girl arrived at the castle, seeking shelter. She claimed to be a princess.\n\nSkeptical, the queen devised a test. She placed a single pea under twenty mattresses and twenty featherbeds where the girl would sleep. The next morning, the queen asked how she rested. The girl confessed to a sleepless night, complaining of something hard pressing into her back. The queen, convinced only a true princess could feel the pea, declared her genuine.\n\nThe prince and the girl were soon married, and the pea was displayed in a museum as proof of their tale. This story teaches the importance of perception and trust."
    },
    {
        "title": "Rapunzel",
        "author": "Brothers Grimm",
        "publication_date": "1812",
        "content": "In a quiet village, a couple longed for a child. The wife craved rapunzel plants from a witch's garden. The husband, desperate to please her, stole some but was caught by the witch. She demanded their unborn child as payment.\n\nThe child, Rapunzel, was taken and locked in a tall tower with no stairs, accessible only by her long golden hair. One day, a prince heard her singing and climbed her hair to reach her. They fell in love and planned her escape, but the witch discovered them.\n\nIn her fury, the witch cut Rapunzel's hair and banished her to a desert. The prince, blinded by the witch, wandered until he found Rapunzel. Her tears of joy restored his sight, and they lived happily ever after, reuniting with Rapunzel's parents."
    },
    {
        "title": "The Tortoise and the Hare",
        "author": "Aesop",
        "publication_date": "600 BCE",
        "content": "In a forest, a hare mocked a slow-moving tortoise, boasting about his speed. Tired of the hare's arrogance, the tortoise challenged him to a race. Amused, the hare accepted.\n\nAt the start, the hare sprinted far ahead, confident of his victory. Feeling smug, he decided to nap under a tree. Meanwhile, the tortoise kept moving steadily, never stopping.\n\nWhen the hare awoke, he saw the tortoise nearing the finish line. Despite his speed, the hare couldn't catch up. The tortoise won, teaching the moral: 'Slow and steady wins the race.'"
    },
    {
        "title": "Aladdin and the Magic Lamp",
        "author": "One Thousand and One Nights",
        "publication_date": "Unknown",
        "content": "In a bustling city, a poor but kind-hearted boy named Aladdin lived with his widowed mother. One day, a mysterious sorcerer tricked him into retrieving a magical lamp from a cave. The sorcerer betrayed him, but Aladdin escaped with the lamp.\n\nWhen he rubbed it, a powerful genie appeared, granting him wishes. Using the genie’s magic, Aladdin gained wealth and married Princess Jasmine. However, the sorcerer returned, stealing the lamp and taking over the palace.\n\nWith courage and wit, Aladdin outsmarted the sorcerer, reclaiming the lamp and saving his loved ones. He used his final wish to free the genie, showing that kindness and bravery always triumph."
    },
    {
        "title": "The Fisherman and the Golden Fish",
        "author": "Alexander Pushkin (Adaptation)",
        "publication_date": "1833",
        "content": "A poor fisherman cast his net into the sea and caught a golden fish that pleaded for its freedom. In return, the fish promised to grant any wish. The fisherman released it, asking for nothing.\n\nWhen he told his wife, she demanded he ask for riches, then a mansion, and finally to become ruler of the seas. Each time, the fish granted the wishes. However, when the wife asked to be a goddess, the fish revoked all the gifts, leaving them in their old hut. The story warns against greed and the consequences of overreaching desires."
    },
    {
        "title": "The Brave Little Tailor",
        "author": "Brothers Grimm",
        "publication_date": "1812",
        "content": "A humble tailor defeated seven flies with a single blow and embroidered 'Seven at One Blow' on his belt. Misunderstood as a great warrior, he embarked on adventures to prove his bravery. Along the way, he outwitted giants, captured a wild unicorn, and subdued a ferocious boar. His cleverness earned him fame, a kingdom, and the hand of a princess. The story illustrates the value of wit and resourcefulness over brute strength."
    },
    {
        "title": "The Elves and the Shoemaker",
        "author": "Brothers Grimm",
        "publication_date": "1812",
        "content": "A poor shoemaker, struggling to make ends meet, cut his last piece of leather, hoping to sell one final pair of shoes. To his surprise, he awoke to find beautifully crafted shoes on his workbench, made overnight by two tiny elves. The shoes sold for a high price, allowing him to buy more leather. The elves returned each night, making exquisite shoes until the shoemaker prospered. Grateful, he and his wife sewed clothing for the elves to thank them. After receiving the clothes, the elves danced away, never to return. The story highlights themes of kindness and gratitude."
    },
    {
        "title": "The Pied Piper of Hamelin",
        "author": "Robert Browning (Adaptation)",
        "publication_date": "1842",
        "content": "The town of Hamelin was overrun with rats. A mysterious piper, dressed in colorful clothes, offered to rid the town of the pests for a fee. Playing an enchanting melody, he led the rats into the river, where they drowned. However, the townspeople refused to pay him. Angered, the piper played a haunting tune, luring the children of Hamelin away. They were never seen again, leaving the town to lament its dishonesty. The story serves as a cautionary tale about the consequences of breaking promises."
    },
    {
        "title": "The Gingerbread Man",
        "author": "Traditional",
        "publication_date": "Unknown",
        "content": "An old woman baked a gingerbread man who magically came to life. He escaped from her oven, chanting, 'Run, run, as fast as you can! You can't catch me, I'm the Gingerbread Man!' Along the way, he outran people and animals, boasting of his speed. However, a clever fox offered to help him cross a river. As the gingerbread man climbed onto the fox's back, the fox tricked him and ate him. The tale reminds us of the dangers of overconfidence and misplaced trust."
    },
    {
        "title": "The Snow Queen",
        "author": "Hans Christian Andersen",
        "publication_date": "1844",
        "content": "Gerda and Kai were best friends until Kai was cursed by shards of a magical mirror, turning his heart cold. The Snow Queen kidnapped him, taking him to her icy palace. Gerda embarked on a perilous journey, aided by kind strangers and animals, to rescue her friend. Her unwavering love and tears broke the curse, melting Kai's frozen heart. Together, they returned home, proving that love and perseverance can overcome any obstacle."
    },
    {
        "title": "The Little Match Girl",
        "author": "Hans Christian Andersen",
        "publication_date": "1845",
        "content": "On a cold New Year's Eve, a poor little girl wandered the streets, barefoot and shivering, trying to sell matches. No one bought them, and she dared not go home as her father would beat her for not earning any money. Seeking warmth, she lit one match after another, each flame bringing her brief moments of comfort and visions of joy—a warm stove, a feast, and her late grandmother, the only person who ever loved her.\n\nAs the last match burned, the girl saw a vision of her grandmother taking her to a place free from pain and cold. The next morning, the townspeople found her lifeless body, surrounded by burnt matches. Though tragic, the story reflects themes of hope, love, and the human spirit enduring in the face of suffering."
    },
    {
        "title": "The Emperor's New Clothes",
        "author": "Hans Christian Andersen",
        "publication_date": "1837",
        "content": "In a bustling kingdom, a vain emperor obsessed with his appearance was approached by two swindlers posing as tailors. They claimed to weave a magical fabric invisible to those who were foolish or incompetent. Intrigued, the emperor paid a fortune for a new suit made of this 'fabric.'\n\nWhen the 'clothes' were delivered, the emperor saw nothing but dared not admit it, fearing he would be deemed unfit to rule. His court, too scared to speak the truth, praised the nonexistent garments. The emperor paraded through the streets in his invisible outfit until a child shouted, 'The emperor has no clothes!' The crowd realized the truth, exposing the emperor's vanity and the deception. The tale emphasizes the value of honesty and the danger of blind conformity."
    },
    {
        "title": "Bluebeard",
        "author": "Charles Perrault",
        "publication_date": "1697",
        "content": "Bluebeard, a wealthy but sinister man with a mysterious past, sought a wife and married a young woman. He gave her the keys to his castle but forbade her from entering one specific room. Curiosity got the better of her, and she opened the forbidden door, discovering the gruesome remains of his previous wives.\n\nHorrified, she dropped the key, staining it with blood that would not wash off. Bluebeard returned, furious at her disobedience, and prepared to kill her. With the help of her siblings, she managed to escape and defeat Bluebeard, claiming his fortune. The story serves as a cautionary tale about the dangers of blind trust and unchecked curiosity."
    },
    {
        "title": "Rumpelstiltskin",
        "author": "Brothers Grimm",
        "publication_date": "1812",
        "content": "A poor miller, seeking favor from the king, boasted that his daughter could spin straw into gold. The king, intrigued, locked the girl in a room filled with straw, demanding she turn it into gold by morning or face death.\n\nDesperate, the girl was visited by a strange little man who offered to help in exchange for her necklace. He spun the straw into gold, and the king, pleased, demanded more. On the third night, when she had nothing left to offer, the little man bargained for her firstborn child. She reluctantly agreed.\n\nYears later, after marrying the king and giving birth, the little man returned to claim his prize. To save her child, the queen was given a chance to guess his name. Through cleverness and persistence, she discovered his name was Rumpelstiltskin, and he fled in anger. The story highlights themes of greed, wit, and the power of words."
    },
    {
        "title": "The Golden Goose",
        "author": "Brothers Grimm",
        "publication_date": "1812",
        "content": "A simple young man, often mocked by his family and called 'Simpleton,' discovered a golden goose in a forest. When he brought it home, anyone who touched it became stuck to it. As he wandered with the goose and the people stuck to it, he attracted a comical parade of followers.\n\nIn a nearby kingdom, a princess who had never laughed saw the bizarre procession and burst into laughter. As a reward, Simpleton was allowed to marry her, proving that kindness and a good heart can lead to unexpected fortune."
    },
    {
        "title": "The Twelve Dancing Princesses",
        "author": "Brothers Grimm",
        "publication_date": "1812",
        "content": "In a grand kingdom, the king had twelve daughters who shared a mysterious secret. Every morning, their shoes were found worn out, though their bedroom door was locked. The king, perplexed, promised a great reward to anyone who could solve the mystery.\n\nA poor soldier accepted the challenge. With the help of an old woman who gave him an invisibility cloak, he followed the princesses one night. To his astonishment, he saw them descending into a hidden underground world where they danced all night in a magical palace.\n\nThe soldier reported his findings to the king. The spell was broken, and the secret passage was sealed. As promised, the soldier married one of the princesses and lived happily ever after. The story highlights themes of bravery, curiosity, and the importance of truth."
    },
    {
        "title": "The Red Shoes",
        "author": "Hans Christian Andersen",
        "publication_date": "1845",
        "content": "Karen, a poor orphan girl, received a pair of beautiful red shoes from a kind woman. Fascinated by their beauty, she wore them everywhere, even to church, against advice. One day, the shoes enchanted her, forcing her to dance uncontrollably.\n\nDesperate to stop, Karen sought help from a woodcutter, who removed the shoes. Stripped of her vanity, Karen found redemption through humility and prayer, living a simpler, more compassionate life thereafter. The story serves as a cautionary tale about pride and the importance of humility."
    },
    {
        "title": "The Sleeping Beauty",
        "author": "Charles Perrault",
        "publication_date": "1697",
        "content": "At a royal christening, a wicked fairy, feeling slighted, cursed the princess to prick her finger on a spindle and fall into a deep sleep on her sixteenth birthday. To mitigate the curse, a good fairy declared she would awaken with true love's kiss.\n\nOn the fateful day, the curse came true, and the princess fell into a magical sleep. The kingdom was encased in thorns and slumbered along with her. After a hundred years, a brave prince ventured through the dangerous thicket, discovering the sleeping princess.\n\nOvercome by her beauty, the prince kissed her, breaking the curse. The kingdom awakened, and the two were married, living happily ever after. The tale embodies themes of love, fate, and perseverance."
    },
    {
        "title": "The Three Feathers",
        "author": "Brothers Grimm",
        "publication_date": "1812",
        "content": "An aging king sought to choose an heir among his three sons. To test them, he released three feathers, asking each son to follow the direction of a feather and bring back the most wondrous item they could find.\n\nThe eldest sons mocked the youngest, Dummling, whose feather led him to a mysterious underground world. There, he found magical treasures, including a golden carpet and a ring with mystical powers.\n\nWhen the sons returned, Dummling's findings surpassed all expectations. He proved himself worthy of the throne, showing that wisdom and humility can triumph over arrogance."
    },
    {
        "title": "The Magic Paintbrush",
        "author": "Traditional (Chinese Folklore)",
        "publication_date": "Unknown",
        "content": "A poor boy named Ma Liang loved to paint but couldn’t afford a brush. One night, he dreamed of a golden paintbrush, and the next morning, he found it on his desk. To his amazement, whatever he painted with it came to life.\n\nMa Liang used the brush to help the needy, creating food and tools for his village. A greedy emperor, hearing of the magical brush, demanded it. Ma Liang, refusing to give it up, cleverly painted a sea to trap the emperor’s soldiers.\n\nThe boy continued to use his gift to help others, teaching that talent and kindness should be used for good."
    }
]


